{
    "name": "Shashank K",
    "email": "shashank.karigowda@gmail.com",
    "phone": "8088445001",
    "summary": "Multitasker with superior work ethic and good teamwork, problem-solving, and organizational skills. Willing to take on any task to help the team. Reliable and dedicated team player with a hardworking and resourceful approach.",
    "skills": ["AWS", "DevOps", "Grafana", "Prometheus", "CyberSecurity", "Java FullStack", "Operating System"],
    "projects": [
        {
            "title": "Online Shopping Cart Application",
            "description": "Developed a web-based shopping cart application that allows users to browse, search, and purchase products online. Implemented user authentication functionality to allow users to sign up, log in, and securely access their Todo lists. The application provides features for adding items to the cart, managing cart contents, and completing the checkout process."
        },
        {
            "title": "Todo-App",
            "description": "Developed a web-based Todo application with database connectivity to provide users with a platform for managing tasks and to-do lists. The application allows users to create, update, delete, and mark tasks as completed, with data persistence enabled through a backend database."
        },
        {
            "title": "BCCI Website Enhancements",
            "description": "Designed and implemented enhancements for the Board of Control for Cricket in India (BCCI) website, focusing on user engagement and accessibility. Successfully deployed the updated website, resulting in improved user experience and increased traffic engagement."
        },
        {
            "title": "Automated Deployment Pipeline",
            "description": "Designed and implemented an automated deployment pipeline for a college resource website to streamline the software delivery process and enhance collaboration among development and operations teams."
        }
    ],
    "education": [
        {
            "institution": "East West Polytechnic",
            "degree": "Mechanical Engineering Diploma",
            "years": "2017–2020"
        },
        {
            "institution": "East West Institution of Technology",
            "degree": "Mechanical Engineering",
            "years": "2020–2023"
        }
    ],
    "hobbies": ["Robotics", "Automation", "Cryptocurrency", "Security Research", "Hardware Projects", "Cloud Computing", "Open Source Contribution"],
    "links": {
        "github": "https://github.com/shashank8617",
        "linkedin": "https://www.linkedin.com/in/shashank-karigowda"
    }
}
